MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAG176/mcu.h
extern volatile __C1FIFOINT11bits_t C1FIFOINT11bits __asm__ ("C1FIFOINT11") __attribute__((section("sfrs"), address(0xBF880620)));
extern volatile uint32_t        C1FIFOINT11CLR __attribute__((section("sfrs"),address(0xBF880624)));
extern volatile uint32_t        C1FIFOINT11SET __attribute__((section("sfrs"),address(0xBF880628)));
extern volatile uint32_t        C1FIFOINT11INV __attribute__((section("sfrs"),address(0xBF88062C)));
#define C1FIFOUA11 C1FIFOUA11
extern volatile uint32_t   C1FIFOUA11 __attribute__((section("sfrs"), address(0xBF880630)));
extern volatile uint32_t        C1FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF880634)));
extern volatile uint32_t        C1FIFOUA11SET __attribute__((section("sfrs"),address(0xBF880638)));
extern volatile uint32_t        C1FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88063C)));
#define C1FIFOCI11 C1FIFOCI11
extern volatile uint32_t   C1FIFOCI11 __attribute__((section("sfrs"), address(0xBF880640)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI11bits_t;
extern volatile __C1FIFOCI11bits_t C1FIFOCI11bits __asm__ ("C1FIFOCI11") __attribute__((section("sfrs"), address(0xBF880640)));
extern volatile uint32_t        C1FIFOCI11CLR __attribute__((section("sfrs"),address(0xBF880644)));
extern volatile uint32_t        C1FIFOCI11SET __attribute__((section("sfrs"),address(0xBF880648)));
extern volatile uint32_t        C1FIFOCI11INV __attribute__((section("sfrs"),address(0xBF88064C)));
#define C1FIFOCON12 C1FIFOCON12
extern volatile uint32_t   C1FIFOCON12 __attribute__((section("sfrs"), address(0xBF880650)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON12bits_t;
extern volatile __C1FIFOCON12bits_t C1FIFOCON12bits __asm__ ("C1FIFOCON12") __attribute__((section("sfrs"), address(0xBF880650)));
extern volatile uint32_t        C1FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF880654)));
extern volatile uint32_t        C1FIFOCON12SET __attribute__((section("sfrs"),address(0xBF880658)));
extern volatile uint32_t        C1FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88065C)));
#define C1FIFOINT12 C1FIFOINT12
extern volatile uint32_t   C1FIFOINT12 __attribute__((section("sfrs"), address(0xBF880660)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT12bits_t;
extern volatile __C1FIFOINT12bits_t C1FIFOINT12bits __asm__ ("C1FIFOINT12") __attribute__((section("sfrs"), address(0xBF880660)));
extern volatile uint32_t        C1FIFOINT12CLR __attribute__((section("sfrs"),address(0xBF880664)));
extern volatile uint32_t        C1FIFOINT12SET __attribute__((section("sfrs"),address(0xBF880668)));
extern volatile uint32_t        C1FIFOINT12INV __attribute__((section("sfrs"),address(0xBF88066C)));
#define C1FIFOUA12 C1FIFOUA12
extern volatile uint32_t   C1FIFOUA12 __attribute__((section("sfrs"), address(0xBF880670)));
extern volatile uint32_t        C1FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF880674)));
extern volatile uint32_t        C1FIFOUA12SET __attribute__((section("sfrs"),address(0xBF880678)));
extern volatile uint32_t        C1FIFOUA12INV __attribute__((section("sfrs"),address(0xBF88067C)));
#define C1FIFOCI12 C1FIFOCI12
extern volatile uint32_t   C1FIFOCI12 __attribute__((section("sfrs"), address(0xBF880680)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI12bits_t;
extern volatile __C1FIFOCI12bits_t C1FIFOCI12bits __asm__ ("C1FIFOCI12") __attribute__((section("sfrs"), address(0xBF880680)));
extern volatile uint32_t        C1FIFOCI12CLR __attribute__((section("sfrs"),address(0xBF880684)));
extern volatile uint32_t        C1FIFOCI12SET __attribute__((section("sfrs"),address(0xBF880688)));
extern volatile uint32_t        C1FIFOCI12INV __attribute__((section("sfrs"),address(0xBF88068C)));
#define C1FIFOCON13 C1FIFOCON13
extern volatile uint32_t   C1FIFOCON13 __attribute__((section("sfrs"), address(0xBF880690)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON13bits_t;
extern volatile __C1FIFOCON13bits_t C1FIFOCON13bits __asm__ ("C1FIFOCON13") __attribute__((section("sfrs"), address(0xBF880690)));
extern volatile uint32_t        C1FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF880694)));
extern volatile uint32_t        C1FIFOCON13SET __attribute__((section("sfrs"),address(0xBF880698)));
extern volatile uint32_t        C1FIFOCON13INV __attribute__((section("sfrs"),address(0xBF88069C)));
#define C1FIFOINT13 C1FIFOINT13
extern volatile uint32_t   C1FIFOINT13 __attribute__((section("sfrs"), address(0xBF8806A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT13bits_t;
