MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAG176/mcu.h
extern volatile __C2FIFOINT16bits_t C2FIFOINT16bits __asm__ ("C2FIFOINT16") __attribute__((section("sfrs"), address(0xBF881760)));
extern volatile uint32_t        C2FIFOINT16CLR __attribute__((section("sfrs"),address(0xBF881764)));
extern volatile uint32_t        C2FIFOINT16SET __attribute__((section("sfrs"),address(0xBF881768)));
extern volatile uint32_t        C2FIFOINT16INV __attribute__((section("sfrs"),address(0xBF88176C)));
#define C2FIFOUA16 C2FIFOUA16
extern volatile uint32_t   C2FIFOUA16 __attribute__((section("sfrs"), address(0xBF881770)));
extern volatile uint32_t        C2FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF881774)));
extern volatile uint32_t        C2FIFOUA16SET __attribute__((section("sfrs"),address(0xBF881778)));
extern volatile uint32_t        C2FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88177C)));
#define C2FIFOCI16 C2FIFOCI16
extern volatile uint32_t   C2FIFOCI16 __attribute__((section("sfrs"), address(0xBF881780)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI16bits_t;
extern volatile __C2FIFOCI16bits_t C2FIFOCI16bits __asm__ ("C2FIFOCI16") __attribute__((section("sfrs"), address(0xBF881780)));
extern volatile uint32_t        C2FIFOCI16CLR __attribute__((section("sfrs"),address(0xBF881784)));
extern volatile uint32_t        C2FIFOCI16SET __attribute__((section("sfrs"),address(0xBF881788)));
extern volatile uint32_t        C2FIFOCI16INV __attribute__((section("sfrs"),address(0xBF88178C)));
#define C2FIFOCON17 C2FIFOCON17
extern volatile uint32_t   C2FIFOCON17 __attribute__((section("sfrs"), address(0xBF881790)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON17bits_t;
extern volatile __C2FIFOCON17bits_t C2FIFOCON17bits __asm__ ("C2FIFOCON17") __attribute__((section("sfrs"), address(0xBF881790)));
extern volatile uint32_t        C2FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF881794)));
extern volatile uint32_t        C2FIFOCON17SET __attribute__((section("sfrs"),address(0xBF881798)));
extern volatile uint32_t        C2FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88179C)));
#define C2FIFOINT17 C2FIFOINT17
extern volatile uint32_t   C2FIFOINT17 __attribute__((section("sfrs"), address(0xBF8817A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT17bits_t;
extern volatile __C2FIFOINT17bits_t C2FIFOINT17bits __asm__ ("C2FIFOINT17") __attribute__((section("sfrs"), address(0xBF8817A0)));
extern volatile uint32_t        C2FIFOINT17CLR __attribute__((section("sfrs"),address(0xBF8817A4)));
extern volatile uint32_t        C2FIFOINT17SET __attribute__((section("sfrs"),address(0xBF8817A8)));
extern volatile uint32_t        C2FIFOINT17INV __attribute__((section("sfrs"),address(0xBF8817AC)));
#define C2FIFOUA17 C2FIFOUA17
extern volatile uint32_t   C2FIFOUA17 __attribute__((section("sfrs"), address(0xBF8817B0)));
extern volatile uint32_t        C2FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF8817B4)));
extern volatile uint32_t        C2FIFOUA17SET __attribute__((section("sfrs"),address(0xBF8817B8)));
extern volatile uint32_t        C2FIFOUA17INV __attribute__((section("sfrs"),address(0xBF8817BC)));
#define C2FIFOCI17 C2FIFOCI17
extern volatile uint32_t   C2FIFOCI17 __attribute__((section("sfrs"), address(0xBF8817C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI17bits_t;
extern volatile __C2FIFOCI17bits_t C2FIFOCI17bits __asm__ ("C2FIFOCI17") __attribute__((section("sfrs"), address(0xBF8817C0)));
extern volatile uint32_t        C2FIFOCI17CLR __attribute__((section("sfrs"),address(0xBF8817C4)));
extern volatile uint32_t        C2FIFOCI17SET __attribute__((section("sfrs"),address(0xBF8817C8)));
extern volatile uint32_t        C2FIFOCI17INV __attribute__((section("sfrs"),address(0xBF8817CC)));
#define C2FIFOCON18 C2FIFOCON18
extern volatile uint32_t   C2FIFOCON18 __attribute__((section("sfrs"), address(0xBF8817D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON18bits_t;
extern volatile __C2FIFOCON18bits_t C2FIFOCON18bits __asm__ ("C2FIFOCON18") __attribute__((section("sfrs"), address(0xBF8817D0)));
extern volatile uint32_t        C2FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF8817D4)));
extern volatile uint32_t        C2FIFOCON18SET __attribute__((section("sfrs"),address(0xBF8817D8)));
extern volatile uint32_t        C2FIFOCON18INV __attribute__((section("sfrs"),address(0xBF8817DC)));
#define C2FIFOINT18 C2FIFOINT18
extern volatile uint32_t   C2FIFOINT18 __attribute__((section("sfrs"), address(0xBF8817E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT18bits_t;
