MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAG176/mcu.h
#define _DDRCMD18_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD18_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD18_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD18_CSCMD2_POSITION                0x0000000D
#define _DDRCMD18_CSCMD2_MASK                    0x001FE000
#define _DDRCMD18_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD18_RASCMD2_POSITION               0x00000015
#define _DDRCMD18_RASCMD2_MASK                   0x00200000
#define _DDRCMD18_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD18_CASCMD2_POSITION               0x00000016
#define _DDRCMD18_CASCMD2_MASK                   0x00400000
#define _DDRCMD18_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD18_WENCMD2_POSITION               0x00000017
#define _DDRCMD18_WENCMD2_MASK                   0x00800000
#define _DDRCMD18_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD18_MDALCMD_POSITION               0x00000018
#define _DDRCMD18_MDALCMD_MASK                   0xFF000000
#define _DDRCMD18_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD19_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD19_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD19_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD19_CSCMD1_POSITION                0x00000001
#define _DDRCMD19_CSCMD1_MASK                    0x000001FE
#define _DDRCMD19_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD19_RASCMD1_POSITION               0x00000009
#define _DDRCMD19_RASCMD1_MASK                   0x00000200
#define _DDRCMD19_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD19_CASCMD1_POSITION               0x0000000A
#define _DDRCMD19_CASCMD1_MASK                   0x00000400
#define _DDRCMD19_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD19_WENCMD1_POSITION               0x0000000B
#define _DDRCMD19_WENCMD1_MASK                   0x00000800
#define _DDRCMD19_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD19_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD19_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD19_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD19_CSCMD2_POSITION                0x0000000D
#define _DDRCMD19_CSCMD2_MASK                    0x001FE000
#define _DDRCMD19_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD19_RASCMD2_POSITION               0x00000015
#define _DDRCMD19_RASCMD2_MASK                   0x00200000
#define _DDRCMD19_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD19_CASCMD2_POSITION               0x00000016
#define _DDRCMD19_CASCMD2_MASK                   0x00400000
#define _DDRCMD19_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD19_WENCMD2_POSITION               0x00000017
#define _DDRCMD19_WENCMD2_MASK                   0x00800000
#define _DDRCMD19_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD19_MDALCMD_POSITION               0x00000018
#define _DDRCMD19_MDALCMD_MASK                   0xFF000000
#define _DDRCMD19_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD110_CLKENCMD1_POSITION            0x00000000
#define _DDRCMD110_CLKENCMD1_MASK                0x00000001
#define _DDRCMD110_CLKENCMD1_LENGTH              0x00000001

#define _DDRCMD110_CSCMD1_POSITION               0x00000001
#define _DDRCMD110_CSCMD1_MASK                   0x000001FE
#define _DDRCMD110_CSCMD1_LENGTH                 0x00000008

#define _DDRCMD110_RASCMD1_POSITION              0x00000009
#define _DDRCMD110_RASCMD1_MASK                  0x00000200
#define _DDRCMD110_RASCMD1_LENGTH                0x00000001

#define _DDRCMD110_CASCMD1_POSITION              0x0000000A
#define _DDRCMD110_CASCMD1_MASK                  0x00000400
#define _DDRCMD110_CASCMD1_LENGTH                0x00000001

#define _DDRCMD110_WENCMD1_POSITION              0x0000000B
#define _DDRCMD110_WENCMD1_MASK                  0x00000800
#define _DDRCMD110_WENCMD1_LENGTH                0x00000001

#define _DDRCMD110_CLKENCMD2_POSITION            0x0000000C
#define _DDRCMD110_CLKENCMD2_MASK                0x00001000
#define _DDRCMD110_CLKENCMD2_LENGTH              0x00000001

#define _DDRCMD110_CSCMD2_POSITION               0x0000000D
#define _DDRCMD110_CSCMD2_MASK                   0x001FE000
#define _DDRCMD110_CSCMD2_LENGTH                 0x00000008

#define _DDRCMD110_RASCMD2_POSITION              0x00000015
#define _DDRCMD110_RASCMD2_MASK                  0x00200000
#define _DDRCMD110_RASCMD2_LENGTH                0x00000001

#define _DDRCMD110_CASCMD2_POSITION              0x00000016
#define _DDRCMD110_CASCMD2_MASK                  0x00400000
#define _DDRCMD110_CASCMD2_LENGTH                0x00000001

#define _DDRCMD110_WENCMD2_POSITION              0x00000017
#define _DDRCMD110_WENCMD2_MASK                  0x00800000
#define _DDRCMD110_WENCMD2_LENGTH                0x00000001

#define _DDRCMD110_MDALCMD_POSITION              0x00000018
#define _DDRCMD110_MDALCMD_MASK                  0xFF000000
#define _DDRCMD110_MDALCMD_LENGTH                0x00000008

#define _DDRCMD111_CLKENCMD1_POSITION            0x00000000
#define _DDRCMD111_CLKENCMD1_MASK                0x00000001
#define _DDRCMD111_CLKENCMD1_LENGTH              0x00000001

#define _DDRCMD111_CSCMD1_POSITION               0x00000001
#define _DDRCMD111_CSCMD1_MASK                   0x000001FE
#define _DDRCMD111_CSCMD1_LENGTH                 0x00000008

#define _DDRCMD111_RASCMD1_POSITION              0x00000009
#define _DDRCMD111_RASCMD1_MASK                  0x00000200
#define _DDRCMD111_RASCMD1_LENGTH                0x00000001

#define _DDRCMD111_CASCMD1_POSITION              0x0000000A
#define _DDRCMD111_CASCMD1_MASK                  0x00000400
#define _DDRCMD111_CASCMD1_LENGTH                0x00000001

#define _DDRCMD111_WENCMD1_POSITION              0x0000000B
#define _DDRCMD111_WENCMD1_MASK                  0x00000800
#define _DDRCMD111_WENCMD1_LENGTH                0x00000001

#define _DDRCMD111_CLKENCMD2_POSITION            0x0000000C
#define _DDRCMD111_CLKENCMD2_MASK                0x00001000
#define _DDRCMD111_CLKENCMD2_LENGTH              0x00000001

#define _DDRCMD111_CSCMD2_POSITION               0x0000000D
#define _DDRCMD111_CSCMD2_MASK                   0x001FE000
#define _DDRCMD111_CSCMD2_LENGTH                 0x00000008

#define _DDRCMD111_RASCMD2_POSITION              0x00000015
#define _DDRCMD111_RASCMD2_MASK                  0x00200000
#define _DDRCMD111_RASCMD2_LENGTH                0x00000001

